[
  {
    "chunk": "Root vegetable mash recipe A great duo of sweet potato and carrot, introducing a combination of flavours for your baby. Age: 6 months or older Prep: 5 mins Cook: 20 mins Portions: 8 (approx) Ingredients - 1 medium sweet potato, peeled and chopped - 1 medium carrot, peeled and chopped Method Place the carrot in a saucepan of water, bring to boil, and cook for about 5 minutes. Put the lid on the pan to speed up the boiling. Add the sweet potato and cook for another 10 to 15 mins until tender. Drain the vegetables. Blend into a purée (or mash with a fork) until you have a soft smooth texture. If the mixture is too thick, add a little full-fat milk or baby’s usual milk. Cool down before serving. Freeze any leftovers in small pots or ice cube trays. Use other root vegetable that you might have at",
    "chunk_id": "root_vegetable_mash_0",
    "title": "Root Vegetable Mash",
    "description": "A great duo of sweet potato and carrot, introducing a combination of flavours for your baby.",
    "source_url": "https://www.nhs.uk/start-for-life/baby/recipes-and-meal-ideas/root-vegetable-mash/",
    "scraped_at": "2025-04-04T07:45:10.533762",
    "tokens": 195,
    "age_range": "6 months or older",
    "prep_time": "5 mins",
    "cook_time": "20 mins",
    "portions": 8,
    "ingredients": [
      "1 medium sweet potato, peeled and chopped",
      "1 medium carrot, peeled and chopped"
    ],
    "weaning_tip": null,
    "meal_type": "unknown"
  },
  {
    "chunk": "little full-fat milk or baby’s usual milk. Cool down before serving. Freeze any leftovers in small pots or ice cube trays. Use other root vegetable that you might have at home too, such as parsnips, butternut squash, cassava, celeriac or swede. Weaning tip Try mashed and finger foods as soon as your baby is ready, to help them learn to chew and swallow solid foods.",
    "chunk_id": "root_vegetable_mash_1",
    "title": "Root Vegetable Mash",
    "description": "A great duo of sweet potato and carrot, introducing a combination of flavours for your baby.",
    "source_url": "https://www.nhs.uk/start-for-life/baby/recipes-and-meal-ideas/root-vegetable-mash/",
    "scraped_at": "2025-04-04T07:45:10.533781",
    "tokens": 84,
    "age_range": "6 months or older",
    "prep_time": "5 mins",
    "cook_time": "20 mins",
    "portions": 8,
    "ingredients": [
      "1 medium sweet potato, peeled and chopped",
      "1 medium carrot, peeled and chopped"
    ],
    "weaning_tip": null,
    "meal_type": "unknown"
  }
]