[
  {
    "chunk": "Babies and young children are especially vulnerable to bacteria that can cause [food poisoning](https://www.nhs.uk/conditions/food-poisoning/). Make sure your child isn't put at risk because of the way you prepare or serve food. - Always [wash your hands](https://www.nhs.uk/live-well/best-way-to-wash-your-hands/)before preparing food and after touching raw meat, chicken, fish and shellfish, raw vegetables and eggs. - Check that your child's hands are clean before feeding. - Teach your children to wash their hands after touching pets and going to the toilet, and before eating. - Keep surfaces clean and keep any pets away from food or surfaces where food is prepared or eaten. - Thoroughly wash all bowls and spoons used for feeding in hot soapy water, and make sure chopping boards and utensils are also kept clean. - Keep raw meats and eggs covered and away from other foods in the fridge, including cooked or ready-to-eat meats – you should always store raw",
    "section": "Keep your child safe from food bugs",
    "source_url": "https://www.nhs.uk/conditions/baby/weaning-and-feeding/childrens-food-safety-and-hygiene/",
    "title": "Childrens Food Safety And Hygiene",
    "chunk_id": "childrens_food_safety_and_hygiene_keep_your_child_safe_from_food_bugs_0",
    "scraped_at": "2025-04-04T05:17:58.885494",
    "tokens": 195
  },
  {
    "chunk": "are also kept clean. - Keep raw meats and eggs covered and away from other foods in the fridge, including cooked or ready-to-eat meats – you should always store raw meats in clean, covered containers at the bottom of the fridge to prevent any drips from falling onto other foods. - Cook all food thoroughly and cool it until lukewarm before giving it to your child. - Don't save and reuse foods that your child has half eaten. - Wash and peel fruit and vegetables such as apples and carrots. - Hens' eggs stamped with the British Lion mark, or produced under the \"Laid in Britain\" scheme, are fine for babies and children to have raw (for example, in homemade mayonnaise) or lightly cooked. - Avoid eating raw or lightly cooked shellfish. Babies and children should only eat shellfish that's been thoroughly cooked. - Don't give children food or drink",
    "section": "Keep your child safe from food bugs",
    "source_url": "https://www.nhs.uk/conditions/baby/weaning-and-feeding/childrens-food-safety-and-hygiene/",
    "title": "Childrens Food Safety And Hygiene",
    "chunk_id": "childrens_food_safety_and_hygiene_keep_your_child_safe_from_food_bugs_1",
    "scraped_at": "2025-04-04T05:17:58.885494",
    "tokens": 195
  },
  {
    "chunk": "mayonnaise) or lightly cooked. - Avoid eating raw or lightly cooked shellfish. Babies and children should only eat shellfish that's been thoroughly cooked. - Don't give children food or drink when they're sitting on the potty. [Find out which foods to avoid giving babies and young children](https://www.nhs.uk/conditions/baby/weaning-and-feeding/foods-to-avoid-giving-babies-and-young-children/)",
    "section": "Keep your child safe from food bugs",
    "source_url": "https://www.nhs.uk/conditions/baby/weaning-and-feeding/childrens-food-safety-and-hygiene/",
    "title": "Childrens Food Safety And Hygiene",
    "chunk_id": "childrens_food_safety_and_hygiene_keep_your_child_safe_from_food_bugs_2",
    "scraped_at": "2025-04-04T05:17:58.885494",
    "tokens": 61
  },
  {
    "chunk": "- Cool food as quickly as possible (ideally within 1 to 2 hours) and put it in the fridge or freezer. Food placed in the fridge should be eaten within 2 days. - Cool rice as quickly as possible (within 1 hour) and put it in the fridge or freezer. Rice placed in the fridge should be eaten within 24 hours and never reheated more than once. [Find out why reheated rice can cause food poisoning](https://www.nhs.uk/common-health-questions/food-and-diet/can-reheating-rice-cause-food-poisoning/). - Frozen food should be thoroughly defrosted before reheating. The safest way to do this is to leave it in the fridge overnight or use the defrost setting on a microwave. - When reheating food, make sure it's steaming hot all the way through, then let it cool down before giving it to your child. If you're using a microwave, always stir the food and check the temperature before feeding it to your child.",
    "section": "Storing and reheating food for children",
    "source_url": "https://www.nhs.uk/conditions/baby/weaning-and-feeding/childrens-food-safety-and-hygiene/",
    "title": "Childrens Food Safety And Hygiene",
    "chunk_id": "childrens_food_safety_and_hygiene_storing_and_reheating_food_for_children_0",
    "scraped_at": "2025-04-04T05:17:58.885494",
    "tokens": 195
  },
  {
    "chunk": "then let it cool down before giving it to your child. If you're using a microwave, always stir the food and check the temperature before feeding it to your child. Don't reheat cooked food more than once. - To cool food quickly, put it in an airtight container and hold it under a cold running tap. Stir it from time to time so it cools consistently all the way through. Remember, always stay with your child while they're eating in case they choke.",
    "section": "Storing and reheating food for children",
    "source_url": "https://www.nhs.uk/conditions/baby/weaning-and-feeding/childrens-food-safety-and-hygiene/",
    "title": "Childrens Food Safety And Hygiene",
    "chunk_id": "childrens_food_safety_and_hygiene_storing_and_reheating_food_for_children_1",
    "scraped_at": "2025-04-04T05:17:58.885494",
    "tokens": 107
  }
]