[
  {
    "chunk": "Exclusive breastfeeding or first infant formula is recommended for around the first 6 months of life. If you're pregnant or breastfeeding, you do not need to avoid foods that can trigger allergic reactions (including peanuts), unless you're allergic to them. Babies who have a cows' milk allergy and are not being breastfed may need special formula. Talk to your GP about what type of formula to give your baby.",
    "section": "Allergies and breastfeeding or formula feeding",
    "source_url": "https://www.nhs.uk/conditions/baby/weaning-and-feeding/food-allergies-in-babies-and-young-children/",
    "title": "Food Allergies In Babies And Young Children",
    "chunk_id": "food_allergies_in_babies_and_young_children_allergies_and_breastfeeding_or_formula_feeding_0",
    "scraped_at": "2025-04-04T05:17:59.155438",
    "tokens": 89
  },
  {
    "chunk": "When you start introducing solid foods to your baby from around 6 months old, introduce the foods that can trigger allergic reactions one at a time and in very small amounts so that you can spot any reaction. If your baby already has an allergy, such as a diagnosed food allergy or eczema, or if you have a family history of food allergies, eczema, asthma or hay fever, you may need to be particularly careful when introducing foods. Talk to your GP or health visitor first. Foods that can trigger an allergic reaction include: - cows' milk - eggs (eggs without a red lion stamp should not be eaten raw or lightly cooked) - foods that contain gluten, including wheat, barley and rye - nuts and peanuts (serve them finely ground or as nut butters) - beans, lentils and peas - seeds, particularly sesame seeds (serve seeds finely ground) -",
    "section": "Introducing foods that could trigger allergy",
    "source_url": "https://www.nhs.uk/conditions/baby/weaning-and-feeding/food-allergies-in-babies-and-young-children/",
    "title": "Food Allergies In Babies And Young Children",
    "chunk_id": "food_allergies_in_babies_and_young_children_introducing_foods_that_could_trigger_allergy_0",
    "scraped_at": "2025-04-04T05:17:59.155438",
    "tokens": 195
  },
  {
    "chunk": "barley and rye - nuts and peanuts (serve them finely ground or as nut butters) - beans, lentils and peas - seeds, particularly sesame seeds (serve seeds finely ground) - soya - shellfish (do not serve raw or lightly cooked) - fish - celery - mustard - sulphur dioxide (sometimes found in dried fruits and fruit juices) These foods can be introduced from around 6 months as part of your baby's diet, just like any other foods. Once introduced and if tolerated, these foods should become part of your baby's usual diet to minimise the risk of allergy. Evidence has shown that delaying the introduction of peanut and hen's eggs beyond 6 to 12 months may increase the risk of developing an allergy to these foods. Lots of children outgrow their allergies to milk or eggs, but some allergies can be lifelong. If your child has a food allergy, read",
    "section": "Introducing foods that could trigger allergy",
    "source_url": "https://www.nhs.uk/conditions/baby/weaning-and-feeding/food-allergies-in-babies-and-young-children/",
    "title": "Food Allergies In Babies And Young Children",
    "chunk_id": "food_allergies_in_babies_and_young_children_introducing_foods_that_could_trigger_allergy_1",
    "scraped_at": "2025-04-04T05:17:59.155438",
    "tokens": 195
  },
  {
    "chunk": "developing an allergy to these foods. Lots of children outgrow their allergies to milk or eggs, but some allergies can be lifelong. If your child has a food allergy, read food labels carefully. Avoid foods if you're not sure whether they contain the food your child is allergic to. How to tell if your child has a food allergy Allergic reactions usually happen quickly within a few minutes of exposure to an allergen, although sometimes they can happen more slowly (over a few hours or days). They can cause: - sneezing - a runny or blocked nose - red, itchy, watery eyes - wheezing and coughing - a red, itchy rash - worsening of [asthma](https://www.nhs.uk/conditions/asthma/)or[eczema](https://www.nhs.uk/conditions/atopic-eczema/)symptoms - feeling or being sick - tummy pain, diarrhoea or constipation Most allergic reactions are mild, but occasionally a severe reaction called [anaphylaxis](https://www.nhs.uk/conditions/anaphylaxis/) or anaphylactic shock can occur. This can cause swelling of the lips",
    "section": "Introducing foods that could trigger allergy",
    "source_url": "https://www.nhs.uk/conditions/baby/weaning-and-feeding/food-allergies-in-babies-and-young-children/",
    "title": "Food Allergies In Babies And Young Children",
    "chunk_id": "food_allergies_in_babies_and_young_children_introducing_foods_that_could_trigger_allergy_2",
    "scraped_at": "2025-04-04T05:17:59.155438",
    "tokens": 195
  },
  {
    "chunk": "- tummy pain, diarrhoea or constipation Most allergic reactions are mild, but occasionally a severe reaction called [anaphylaxis](https://www.nhs.uk/conditions/anaphylaxis/) or anaphylactic shock can occur. This can cause swelling of the lips and face, and breathing problems. Anaphylaxis is a medical emergency and needs urgent treatment. Do not be tempted to experiment by cutting out a major food, such as milk, because this could lead to your child not getting the nutrients they need. Talk to your health visitor or GP, who may refer you to a registered dietitian.",
    "section": "Introducing foods that could trigger allergy",
    "source_url": "https://www.nhs.uk/conditions/baby/weaning-and-feeding/food-allergies-in-babies-and-young-children/",
    "title": "Food Allergies In Babies And Young Children",
    "chunk_id": "food_allergies_in_babies_and_young_children_introducing_foods_that_could_trigger_allergy_3",
    "scraped_at": "2025-04-04T05:17:59.155438",
    "tokens": 113
  },
  {
    "chunk": "Food contains additives for many reasons, such as to preserve it, to help make it safe to eat for longer, and to give colour or texture. All food additives go through strict safety testing before they can be used. Food labelling must clearly show additives in the list of ingredients, including their name or \"E\" number and their function, such as \"colour\" or \"preservative\". A few people have adverse reactions to some food additives, like sulphites, but reactions to ordinary foods, such as milk or soya, are much more common.",
    "section": "Food additives and children",
    "source_url": "https://www.nhs.uk/conditions/baby/weaning-and-feeding/food-allergies-in-babies-and-young-children/",
    "title": "Food Allergies In Babies And Young Children",
    "chunk_id": "food_allergies_in_babies_and_young_children_food_additives_and_children_0",
    "scraped_at": "2025-04-04T05:17:59.155438",
    "tokens": 117
  },
  {
    "chunk": "Find out more about:",
    "section": "Further information",
    "source_url": "https://www.nhs.uk/conditions/baby/weaning-and-feeding/food-allergies-in-babies-and-young-children/",
    "title": "Food Allergies In Babies And Young Children",
    "chunk_id": "food_allergies_in_babies_and_young_children_further_information_0",
    "scraped_at": "2025-04-04T05:17:59.155438",
    "tokens": 5
  }
]