[
  {
    "chunk": "It's natural to worry whether your child is getting enough food if they refuse to eat sometimes. But it's perfectly normal for toddlers to refuse to eat or even taste new foods. Do not worry about what your child eats in a day or if they do not eat everything at mealtimes. It's more helpful to think about what they eat over a week. If your child is active and gaining weight, and they seem well, then they're getting enough to eat. As long as your child eats some food from the 4 main food groups (fruit and vegetables; potatoes, bread, rice, pasta and other starchy carbohydrates; dairy or dairy alternatives; and beans, pulses, fish, eggs, meat and other proteins) you do not need to worry. Find out more about [what to feed young children](https://www.nhs.uk/conditions/baby/weaning-and-feeding/what-to-feed-young-children/). Gradually introduce other foods and keep going back to the foods your child did not",
    "section": "Unknown",
    "source_url": "https://www.nhs.uk/conditions/baby/weaning-and-feeding/fussy-eaters/",
    "title": "Fussy Eaters",
    "chunk_id": "fussy_eaters_unknown_0",
    "scraped_at": "2025-04-04T05:17:59.420594",
    "tokens": 195
  },
  {
    "chunk": "you do not need to worry. Find out more about [what to feed young children](https://www.nhs.uk/conditions/baby/weaning-and-feeding/what-to-feed-young-children/). Gradually introduce other foods and keep going back to the foods your child did not like before. Children's tastes change. One day they'll hate something, but a month later they may love it. Keep offering a variety of foods – it may take lots of attempts before your child accepts some foods.",
    "section": "Unknown",
    "source_url": "https://www.nhs.uk/conditions/baby/weaning-and-feeding/fussy-eaters/",
    "title": "Fussy Eaters",
    "chunk_id": "fussy_eaters_unknown_1",
    "scraped_at": "2025-04-04T05:17:59.420594",
    "tokens": 87
  },
  {
    "chunk": "- Give your child the same food as the rest of the family, but remember not to add salt to your child's food. Check the [food labels of any food product](https://www.nhs.uk/live-well/eat-well/food-guidelines-and-food-labels/how-to-read-food-labels/)you use to make family meals. - The best way for your child to learn to eat and enjoy new foods is to copy you. Try to eat with them as often as you can. - Give small portions and praise your child for eating, even if they only eat a little. - If your child rejects the food, do not force them to eat it. Just take the food away without saying anything. Try to stay calm, even if it's very frustrating. Try the food again another time. - Do not leave meals until your child is too hungry or tired to eat. - Your child may be a slow eater, so be patient. - Do not give your",
    "section": "Tips for parents of fussy eaters",
    "source_url": "https://www.nhs.uk/conditions/baby/weaning-and-feeding/fussy-eaters/",
    "title": "Fussy Eaters",
    "chunk_id": "fussy_eaters_tips_for_parents_of_fussy_eaters_0",
    "scraped_at": "2025-04-04T05:17:59.420594",
    "tokens": 195
  },
  {
    "chunk": "Do not leave meals until your child is too hungry or tired to eat. - Your child may be a slow eater, so be patient. - Do not give your child too many snacks between meals – 2 healthy snacks a day is plenty. - Do not use food as a reward. Your child may start to think of sweets as nice and vegetables as nasty. Instead, reward them with a trip to the park or promise to play a game with them. - Make mealtimes enjoyable and not just about eating. Sit down and chat about other things. - If you know any other children of the same age who are good eaters, ask them round for tea. But do not talk too much about how good the other children are. - Ask an adult that your child likes and looks up to to eat with you. Sometimes a",
    "section": "Tips for parents of fussy eaters",
    "source_url": "https://www.nhs.uk/conditions/baby/weaning-and-feeding/fussy-eaters/",
    "title": "Fussy Eaters",
    "chunk_id": "fussy_eaters_tips_for_parents_of_fussy_eaters_1",
    "scraped_at": "2025-04-04T05:17:59.420594",
    "tokens": 195
  },
  {
    "chunk": "do not talk too much about how good the other children are. - Ask an adult that your child likes and looks up to to eat with you. Sometimes a child will eat for someone else, such as a grandparent, without any fuss. - Changing how you serve a food may make it more appealing. For example, your child might refuse cooked carrots but enjoy raw grated carrot.",
    "section": "Tips for parents of fussy eaters",
    "source_url": "https://www.nhs.uk/conditions/baby/weaning-and-feeding/fussy-eaters/",
    "title": "Fussy Eaters",
    "chunk_id": "fussy_eaters_tips_for_parents_of_fussy_eaters_2",
    "scraped_at": "2025-04-04T05:17:59.420594",
    "tokens": 88
  },
  {
    "chunk": "Video: How do I manage a fussy eater? (18 to 30 months) This video explains how to manage a fussy eater. Media review due: 2 December 2026",
    "section": "Further information",
    "source_url": "https://www.nhs.uk/conditions/baby/weaning-and-feeding/fussy-eaters/",
    "title": "Fussy Eaters",
    "chunk_id": "fussy_eaters_further_information_0",
    "scraped_at": "2025-04-04T05:17:59.420594",
    "tokens": 35
  }
]