[
  {
    "chunk": "The government recommends all children aged 6 months to 5 years are given vitamin supplements containing vitamins A, C and D every day. Babies who are having more than 500ml (about a pint) of infant formula a day should not be given vitamin supplements. This is because formula is fortified with vitamins A, C and D and other nutrients. Babies who are being breastfed should be given a daily vitamin D supplement from birth, whether or not you're taking a supplement containing vitamin D yourself.",
    "section": "Vitamin supplements",
    "source_url": "https://www.nhs.uk/conditions/baby/weaning-and-feeding/vitamins-for-children/",
    "title": "Vitamins For Children",
    "chunk_id": "vitamins_for_children_vitamin_supplements_0",
    "scraped_at": "2025-04-04T05:17:59.544579",
    "tokens": 110
  },
  {
    "chunk": "Your health visitor can give you advice on vitamin drops and tell you where to get them. You're entitled to free vitamin drops if you qualify for [Healthy Start](https://www.healthystart.nhs.uk/). The Department of Health and Social Care only recommends vitamin supplements containing vitamins A, C and D. But some supplements you can buy contain other vitamins or ingredients. Talk to a pharmacist about which supplement would be most suitable for your child. Having too much of some vitamins can be harmful. Keep to the dose recommended on the label, and be careful not to give your child 2 supplements at the same time. For example, do not give them cod liver oil and vitamin drops because cod liver oil also contains vitamins A and D. One supplement on its own is enough, as long as it contains the recommended dose of vitamin D.",
    "section": "Where you can get baby vitamin drops",
    "source_url": "https://www.nhs.uk/conditions/baby/weaning-and-feeding/vitamins-for-children/",
    "title": "Vitamins For Children",
    "chunk_id": "vitamins_for_children_where_you_can_get_baby_vitamin_drops_0",
    "scraped_at": "2025-04-04T05:17:59.544579",
    "tokens": 184
  },
  {
    "chunk": "vitamins A and D. One supplement on its own is enough, as long as it contains the recommended dose of vitamin D.",
    "section": "Where you can get baby vitamin drops",
    "source_url": "https://www.nhs.uk/conditions/baby/weaning-and-feeding/vitamins-for-children/",
    "title": "Vitamins For Children",
    "chunk_id": "vitamins_for_children_where_you_can_get_baby_vitamin_drops_1",
    "scraped_at": "2025-04-04T05:17:59.544579",
    "tokens": 28
  },
  {
    "chunk": "[Vitamin D](https://www.nhs.uk/conditions/vitamins-and-minerals/vitamin-d/) is only found in a few foods, such as oily fish and eggs. It's also added to some foods, such as fat spreads and breakfast cereals. But it's difficult to get enough vitamin D from food alone. The main source of vitamin D is summer sunlight on our skin. But it's important to keep your child's skin safe in the sun. Children should not be out in the sun too long in hot weather. Remember to cover up or protect their skin before it turns red or burns. Young children should still have vitamin drops, even if they get out in the sun. The Department of Health and Social Care recommends: - Babies from birth to 1 year of age who are being breastfed should be given a daily supplement containing 8.5 to 10 micrograms of vitamin D to make sure they get enough. This is whether or",
    "section": "Vitamin D",
    "source_url": "https://www.nhs.uk/conditions/baby/weaning-and-feeding/vitamins-for-children/",
    "title": "Vitamins For Children",
    "chunk_id": "vitamins_for_children_vitamin_d_0",
    "scraped_at": "2025-04-04T05:17:59.544579",
    "tokens": 195
  },
  {
    "chunk": "of age who are being breastfed should be given a daily supplement containing 8.5 to 10 micrograms of vitamin D to make sure they get enough. This is whether or not you're taking a supplement containing vitamin D yourself. - Babies fed infant formula should not be given a vitamin D supplement if they're having more than 500ml (about a pint) of infant formula a day, because infant formula is fortified with vitamin D and other nutrients. - Children aged 1 to 4 years old should be given a daily supplement containing 10 micrograms of vitamin D.",
    "section": "Vitamin D",
    "source_url": "https://www.nhs.uk/conditions/baby/weaning-and-feeding/vitamins-for-children/",
    "title": "Vitamins For Children",
    "chunk_id": "vitamins_for_children_vitamin_d_1",
    "scraped_at": "2025-04-04T05:17:59.544579",
    "tokens": 126
  },
  {
    "chunk": "[Vitamin A](https://www.nhs.uk/conditions/vitamins-and-minerals/vitamin-a/) is important for babies and young children, and some may not be getting enough. It's needed for a healthy immune system, can help their vision in dim light, and keeps skin healthy. Good sources of vitamin A include: - dairy products - fortified fat spreads - carrots, sweet potatoes, swede and mangoes - dark green vegetables, such as spinach, cabbage and broccoli",
    "section": "Vitamin A",
    "source_url": "https://www.nhs.uk/conditions/baby/weaning-and-feeding/vitamins-for-children/",
    "title": "Vitamins For Children",
    "chunk_id": "vitamins_for_children_vitamin_a_0",
    "scraped_at": "2025-04-04T05:17:59.544579",
    "tokens": 83
  },
  {
    "chunk": "[Vitamin C](https://www.nhs.uk/conditions/vitamins-and-minerals/vitamin-c/) is important for your child's general health and immune system. It can also help their body absorb iron. Good sources of vitamin C include: - oranges - kiwi fruit - strawberries - broccoli - tomatoes - peppers",
    "section": "Vitamin C",
    "source_url": "https://www.nhs.uk/conditions/baby/weaning-and-feeding/vitamins-for-children/",
    "title": "Vitamins For Children",
    "chunk_id": "vitamins_for_children_vitamin_c_0",
    "scraped_at": "2025-04-04T05:17:59.544579",
    "tokens": 50
  },
  {
    "chunk": "It's important for children to eat a wide variety of foods to make sure they're getting all the energy and nutrients they need to grow and develop properly. Get more advice and information on a balanced diet for babies and young children:",
    "section": "A balanced diet for babies and young children",
    "source_url": "https://www.nhs.uk/conditions/baby/weaning-and-feeding/vitamins-for-children/",
    "title": "Vitamins For Children",
    "chunk_id": "vitamins_for_children_a_balanced_diet_for_babies_and_young_children_0",
    "scraped_at": "2025-04-04T05:17:59.544579",
    "tokens": 54
  }
]