[
  {
    "chunk": "What are healthy snacks for young children? You could try: - raw vegetable sticks, such as cucumber and carrots, on their own or with hummus - a piece of fruit - a plain unsweetened yoghurt with a sliced banana in it - a slice of toast with cheese spread, hummus or peanut butter - some crackers, breadsticks or unsalted rice cakes with cheese and vegetable sticks - a bowl of unsweetened cereal with pasteurised whole or semi-skimmed milk What can I pack in my child's lunchbox when they go to nursery? Good sandwich fillings include canned tuna or salmon, hummus, hard or cream cheese, egg or peanut butter. For egg and peanuts, see advice on [food allergies in babies and young children](https://www.nhs.uk/conditions/baby/weaning-and-feeding/food-allergies-in-babies-and-young-children/). You could also pack a few vegetable sticks, such as carrots, peppers or cucumber, as well as a container of bite-sized fruit – for example, a peeled satsuma",
    "section": "Unknown",
    "source_url": "https://www.nhs.uk/conditions/baby/weaning-and-feeding/young-children-and-food-common-questions/",
    "title": "Young Children And Food Common Questions",
    "chunk_id": "young_children_and_food_common_questions_unknown_0",
    "scraped_at": "2025-04-04T05:18:00.744350",
    "tokens": 195
  },
  {
    "chunk": "young children](https://www.nhs.uk/conditions/baby/weaning-and-feeding/food-allergies-in-babies-and-young-children/). You could also pack a few vegetable sticks, such as carrots, peppers or cucumber, as well as a container of bite-sized fruit – for example, a peeled satsuma or washed seedless grapes cut in half length ways. A box of raisins is fine if eaten alongside their lunch. Examples of healthier sweet options include a yoghurt, fromage frais, a scone or a currant bun. If you include a fromage frais or yoghurt, do not forget a spoon. A piece of kitchen towel is also useful. You can give water or pasteurised whole or semi-skimmed milk in a leak-proof beaker. If lunchboxes are not kept in the fridge at nursery, use an insulated box with an ice pack to keep food safe and cool. Always check with your nursey for any food policies (for instance, some nurseries may be peanut or nut free). If your child has a food",
    "section": "Unknown",
    "source_url": "https://www.nhs.uk/conditions/baby/weaning-and-feeding/young-children-and-food-common-questions/",
    "title": "Young Children And Food Common Questions",
    "chunk_id": "young_children_and_food_common_questions_unknown_1",
    "scraped_at": "2025-04-04T05:18:00.744350",
    "tokens": 195
  },
  {
    "chunk": "keep food safe and cool. Always check with your nursey for any food policies (for instance, some nurseries may be peanut or nut free). If your child has a food allergy, make sure to tell their nursery or childminder. [Find healthier lunchbox recipes on the Healthier Families website](https://www.nhs.uk/change4life/recipes/healthier-lunchboxes/). I've heard that high-fibre foods are not suitable for young children. Why? Fibre is an important part of a healthy, balanced diet. But foods that contain a lot of fibre (such as wholemeal bread and pasta, brown rice and wholegrain breakfast cereals) can fill up small tummies, leaving little room for other foods. This means your child can feel full before getting the calories and nutrients they need. It's good for your child to try different kinds of starchy foods, but do not give only wholegrain or high-fibre foods before your child is 5 years old. My child will only drink sugary",
    "section": "Unknown",
    "source_url": "https://www.nhs.uk/conditions/baby/weaning-and-feeding/young-children-and-food-common-questions/",
    "title": "Young Children And Food Common Questions",
    "chunk_id": "young_children_and_food_common_questions_unknown_2",
    "scraped_at": "2025-04-04T05:18:00.744350",
    "tokens": 195
  },
  {
    "chunk": "child to try different kinds of starchy foods, but do not give only wholegrain or high-fibre foods before your child is 5 years old. My child will only drink sugary drinks. What can I do? Drinking sugary drinks increases the chance of tooth decay. If your child will only drink sugary drinks, it can take a while to break the habit. Start to dilute the drinks with water, increasing the amount of water gradually over time, so the change is not too noticeable to them. Water and pasteurised cows’ milk (or goats’ or sheep’s milk) are the best drinks for young children. See [drinks and cups for babies and young children](https://www.nhs.uk/conditions/baby/weaning-and-feeding/drinks-and-cups-for-babies-and-young-children/) for more information about drinks. Am I entitled to any benefits to help me buy healthy food for my child? The Healthy Start scheme may be able to help you buy food and milk if: - you have children",
    "section": "Unknown",
    "source_url": "https://www.nhs.uk/conditions/baby/weaning-and-feeding/young-children-and-food-common-questions/",
    "title": "Young Children And Food Common Questions",
    "chunk_id": "young_children_and_food_common_questions_unknown_3",
    "scraped_at": "2025-04-04T05:18:00.744350",
    "tokens": 195
  },
  {
    "chunk": "any benefits to help me buy healthy food for my child? The Healthy Start scheme may be able to help you buy food and milk if: - you have children under 4 and get certain benefits, like income support - you're at least 10 weeks pregnant and get certain benefits, like income support - you're pregnant and under 18 If you’re eligible, you’ll be sent a Healthy Start card which you can use to buy certain types of milk, infant formula, fruit and vegetables. For more information, or to apply for a card, [visit the Healthy Start scheme website](https://www.healthystart.nhs.uk/).",
    "section": "Unknown",
    "source_url": "https://www.nhs.uk/conditions/baby/weaning-and-feeding/young-children-and-food-common-questions/",
    "title": "Young Children And Food Common Questions",
    "chunk_id": "young_children_and_food_common_questions_unknown_4",
    "scraped_at": "2025-04-04T05:18:00.744350",
    "tokens": 128
  }
]