[
  {
    "chunk": "If you need some inspiration to help you cook healthy and tasty food for your child, try these meal ideas. These are not suitable as first foods but are fine once your baby is used to eating a wide range of solid foods. [Read more about your baby's first solid foods](https://www.nhs.uk/conditions/baby/weaning-and-feeding/babys-first-solid-foods/). When preparing food for babies, do not add sugar or salt (including stock cubes and gravy) directly to the food or to the cooking water. Full-fat cheese, yoghurt and fromage frais are recommended up to the age of 2 years. But it’s ok to give lower fat options over the age of 2. [You can find more recipes and meal ideas on the Start for Life website](https://www.nhs.uk/start-for-life/baby/recipes-and-meal-ideas/)",
    "section": "Unknown",
    "source_url": "https://www.nhs.uk/conditions/baby/weaning-and-feeding/baby-and-toddler-meal-ideas/",
    "title": "Baby And Toddler Meal Ideas",
    "chunk_id": "baby_and_toddler_meal_ideas_unknown_0",
    "scraped_at": "2025-04-04T05:17:58.730347",
    "tokens": 153
  },
  {
    "chunk": "- unsweetened porridge or lower-sugar cereal mixed with pasteurised whole or semi-skimmed milk and topped with fruit, such as mashed ripe pear or banana - wholewheat biscuit cereal (choose lower-sugar options) with pasteurised whole or semi-skimmed milk and fruit - lower-sugar breakfast cereal and unsweetened stewed apple with plain, unsweetened yoghurt - toast fingers with mashed banana and smooth peanut butter (if possible, choose unsalted and no added sugar varieties) - toast fingers with a hard-boiled egg and slices of tomato, banana or ripe peach - toast or muffin fingers with scrambled egg and slices of tomato",
    "section": "Breakfast ideas for babies and young children",
    "source_url": "https://www.nhs.uk/conditions/baby/weaning-and-feeding/baby-and-toddler-meal-ideas/",
    "title": "Baby And Toddler Meal Ideas",
    "chunk_id": "baby_and_toddler_meal_ideas_breakfast_ideas_for_babies_and_young_children_0",
    "scraped_at": "2025-04-04T05:17:58.730347",
    "tokens": 126
  },
  {
    "chunk": "- lamb curry with rice - cauliflower cheese with cooked pasta pieces - baked beans (reduced salt and sugar) with toast - scrambled egg with toast, chapatti or pitta bread served with vegetable finger foods - cottage cheese dip with pitta bread, cucumber and carrot sticks",
    "section": "Lunch ideas for babies and young children",
    "source_url": "https://www.nhs.uk/conditions/baby/weaning-and-feeding/baby-and-toddler-meal-ideas/",
    "title": "Baby And Toddler Meal Ideas",
    "chunk_id": "baby_and_toddler_meal_ideas_lunch_ideas_for_babies_and_young_children_0",
    "scraped_at": "2025-04-04T05:17:58.730347",
    "tokens": 59
  },
  {
    "chunk": "- mashed sweet potato with chickpeas and cauliflower - shepherd's pie (made with beef or lamb and/or lentils or vegetarian mince) with green vegetables - rice and mashed peas with courgette sticks - minced chicken and vegetable casserole with mashed potato - mashed canned salmon with couscous and peas - fish poached in milk with potato, broccoli and carrot",
    "section": "Dinner ideas for babies and young children",
    "source_url": "https://www.nhs.uk/conditions/baby/weaning-and-feeding/baby-and-toddler-meal-ideas/",
    "title": "Baby And Toddler Meal Ideas",
    "chunk_id": "baby_and_toddler_meal_ideas_dinner_ideas_for_babies_and_young_children_0",
    "scraped_at": "2025-04-04T05:17:58.730347",
    "tokens": 76
  },
  {
    "chunk": "Finger food is food that's cut up into pieces big enough for your child to hold in their fist with a bit sticking out. Pieces about the size of your own finger work well. Examples of finger foods: - soft-cooked vegetables, such as broccoli, cauliflower, courgette, parsnip and sweet potato - carrot or cucumber sticks and avocado - fresh fruits, such as apple (soft-cooked if needed), banana or soft, ripe peeled pear or peach - toast, pitta or chapatti fingers - unsalted and unsweetened rice or corn cakes - strips of meat without bones, such as chicken and lamb - cheese on toast fingers, made with cheese, and cucumber - hard boiled eggs - omelette fingers",
    "section": "Finger foods for babies and young children",
    "source_url": "https://www.nhs.uk/conditions/baby/weaning-and-feeding/baby-and-toddler-meal-ideas/",
    "title": "Baby And Toddler Meal Ideas",
    "chunk_id": "baby_and_toddler_meal_ideas_finger_foods_for_babies_and_young_children_0",
    "scraped_at": "2025-04-04T05:17:58.730347",
    "tokens": 150
  },
  {
    "chunk": "Babies under 12 months do not need snacks; if you think your baby is hungry in between meals, offer extra milk feeds instead. Once your baby is 1 year old, you can introduce 2 healthy snacks in between meals. For example: - vegetables, such as broccoli florets, carrot sticks or cucumber sticks - slices of fruit, such as apple, banana or soft, ripe peeled pear or peach - pasteurised, plain, unsweetened yoghurt - toast, pitta or chapatti fingers - unsalted and unsweetened rice or corn cakes - small strips of cheese",
    "section": "Healthy snacks for young children",
    "source_url": "https://www.nhs.uk/conditions/baby/weaning-and-feeding/baby-and-toddler-meal-ideas/",
    "title": "Baby And Toddler Meal Ideas",
    "chunk_id": "baby_and_toddler_meal_ideas_healthy_snacks_for_young_children_0",
    "scraped_at": "2025-04-04T05:17:58.730347",
    "tokens": 118
  },
  {
    "chunk": "It may take up to 10 tries, or even more, for your child to get used to new foods, flavour and textures. Be patient and keep offering a variety of fruits and vegetables, including ones with bitter flavours, such as broccoli, cauliflower, spinach and cabbage. Try to make sure fruits and vegetables are included in every meal. To help your child eat more fruit and vegetables: - give carrot sticks, cucumber sticks or slices of pepper with hummus as a snack - give apple slices with smooth peanut butter as a snack - mix chopped or mashed vegetables with rice, mashed potatoes, meat sauces or dhal - add vegetables to classic savoury dishes such as cottage or shepherd's pie, spaghetti bolognese or casseroles - chop prunes or dried apricots into cereal or plain, unsweetened yoghurt, or add them to a stew - for a tasty dessert, try mixing fruit (fresh,",
    "section": "Getting your child to eat fruit and vegetables",
    "source_url": "https://www.nhs.uk/conditions/baby/weaning-and-feeding/baby-and-toddler-meal-ideas/",
    "title": "Baby And Toddler Meal Ideas",
    "chunk_id": "baby_and_toddler_meal_ideas_getting_your_child_to_eat_fruit_and_vegetables_0",
    "scraped_at": "2025-04-04T05:17:58.730347",
    "tokens": 195
  },
  {
    "chunk": "bolognese or casseroles - chop prunes or dried apricots into cereal or plain, unsweetened yoghurt, or add them to a stew - for a tasty dessert, try mixing fruit (fresh, canned or stewed) with plain, unsweetened yoghurt Read more about [helping your baby enjoy new foods](https://www.nhs.uk/conditions/baby/weaning-and-feeding/help-your-baby-enjoy-new-foods/) and [fussy eaters](https://www.nhs.uk/conditions/baby/weaning-and-feeding/fussy-eaters/).",
    "section": "Getting your child to eat fruit and vegetables",
    "source_url": "https://www.nhs.uk/conditions/baby/weaning-and-feeding/baby-and-toddler-meal-ideas/",
    "title": "Baby And Toddler Meal Ideas",
    "chunk_id": "baby_and_toddler_meal_ideas_getting_your_child_to_eat_fruit_and_vegetables_1",
    "scraped_at": "2025-04-04T05:17:58.730347",
    "tokens": 63
  },
  {
    "chunk": "Find out about [drinks and cups for babies and young children](https://www.nhs.uk/conditions/baby/weaning-and-feeding/drinks-and-cups-for-babies-and-young-children/).",
    "section": "Drinks for babies and young children",
    "source_url": "https://www.nhs.uk/conditions/baby/weaning-and-feeding/baby-and-toddler-meal-ideas/",
    "title": "Baby And Toddler Meal Ideas",
    "chunk_id": "baby_and_toddler_meal_ideas_drinks_for_babies_and_young_children_0",
    "scraped_at": "2025-04-04T05:17:58.730347",
    "tokens": 14
  }
]