[
  {
    "chunk": "You should continue to breastfeed or give your baby first infant formula until they're at least 1 year old. Breastfeeding will continue to benefit you and your baby for as long as you carry on. As your baby eats more solid foods, the amount of milk they want will decrease. Once your baby is eating plenty of solids several times a day, they may even drop a milk feed altogether.",
    "section": "Solid foods and milk for your baby",
    "source_url": "https://www.nhs.uk/conditions/baby/weaning-and-feeding/drinks-and-cups-for-babies-and-young-children/",
    "title": "Drinks And Cups For Babies And Young Children",
    "chunk_id": "drinks_and_cups_for_babies_and_young_children_solid_foods_and_milk_for_your_baby_0",
    "scraped_at": "2025-04-04T05:17:59.022092",
    "tokens": 91
  },
  {
    "chunk": "Introduce your baby to drinking from a cup or beaker from around 6 months and offer sips of water with meals. Using an open cup or a free-flow cup without a valve will help your baby learn to sip and is better for your baby’s teeth. It might be messy at first but be patient, your baby will gradually learn how to drink from an open cup. Once your baby is 1 year old, feeding from a bottle should be discouraged. When using a bottle or trainer cup, do not put anything in it other than breast milk, formula milk or water, and do not add anything else (including sugar, cereals, baby rice or chocolate powder) to the feed. Comfort sucking from a bottle on sweetened drinks causes [tooth decay](https://www.nhs.uk/conditions/tooth-decay/) in young children. Drinks flow very slowly through a teat, which means the sugary substance will be in contact with",
    "section": "Beakers and cups for babies",
    "source_url": "https://www.nhs.uk/conditions/baby/weaning-and-feeding/drinks-and-cups-for-babies-and-young-children/",
    "title": "Drinks And Cups For Babies And Young Children",
    "chunk_id": "drinks_and_cups_for_babies_and_young_children_beakers_and_cups_for_babies_0",
    "scraped_at": "2025-04-04T05:17:59.022092",
    "tokens": 195
  },
  {
    "chunk": "sucking from a bottle on sweetened drinks causes [tooth decay](https://www.nhs.uk/conditions/tooth-decay/) in young children. Drinks flow very slowly through a teat, which means the sugary substance will be in contact with their teeth for longer.",
    "section": "Beakers and cups for babies",
    "source_url": "https://www.nhs.uk/conditions/baby/weaning-and-feeding/drinks-and-cups-for-babies-and-young-children/",
    "title": "Drinks And Cups For Babies And Young Children",
    "chunk_id": "drinks_and_cups_for_babies_and_young_children_beakers_and_cups_for_babies_1",
    "scraped_at": "2025-04-04T05:17:59.022092",
    "tokens": 44
  },
  {
    "chunk": "It's important to choose the right kind of beaker or cup. A cup or beaker with a free-flow lid (without a non-spill valve) is better than a bottle or beaker with a teat as it will help your baby learn how to sip rather than suck. As soon as your child is ready, encourage them to move from a lidded beaker to drinking from an open cup.",
    "section": "Choosing a baby beaker or cup",
    "source_url": "https://www.nhs.uk/conditions/baby/weaning-and-feeding/drinks-and-cups-for-babies-and-young-children/",
    "title": "Drinks And Cups For Babies And Young Children",
    "chunk_id": "drinks_and_cups_for_babies_and_young_children_choosing_a_baby_beaker_or_cup_0",
    "scraped_at": "2025-04-04T05:17:59.022092",
    "tokens": 87
  },
  {
    "chunk": "Not all drinks are suitable for babies and young children. Here's what to give to your child and when.",
    "section": "Drinks for babies and young children",
    "source_url": "https://www.nhs.uk/conditions/baby/weaning-and-feeding/drinks-and-cups-for-babies-and-young-children/",
    "title": "Drinks And Cups For Babies And Young Children",
    "chunk_id": "drinks_and_cups_for_babies_and_young_children_drinks_for_babies_and_young_children_0",
    "scraped_at": "2025-04-04T05:17:59.022092",
    "tokens": 24
  },
  {
    "chunk": "Breast milk is the only food or drink babies need in the first 6 months of their life. It should continue to be given alongside an increasingly varied diet once you introduce solid foods from around 6 months. The World Health Organization recommends that all babies are breastfed for up to 2 years or longer. Breastfeeding up to 12 months is associated with a lower risk of tooth decay.",
    "section": "Breast milk",
    "source_url": "https://www.nhs.uk/conditions/baby/weaning-and-feeding/drinks-and-cups-for-babies-and-young-children/",
    "title": "Drinks And Cups For Babies And Young Children",
    "chunk_id": "drinks_and_cups_for_babies_and_young_children_breast_milk_0",
    "scraped_at": "2025-04-04T05:17:59.022092",
    "tokens": 89
  },
  {
    "chunk": "First infant formula is usually based on cows' milk and is the only suitable alternative to breast milk in the first 12 months of your baby's life. All infant formula in the UK has to meet the same standards to help babies grow and develop. It does not matter if you choose a cheaper or more expensive brand of formula. Follow-on formula is not suitable for babies under 6 months, and you do not need to introduce it after 6 months. Formula milks are not needed once your baby is 12 months old. This includes first infant formula, follow-on formula, growing-up milks and toddler milks. Cows' milk can be introduced as a main drink from 12 months. [Read more about the types of infant formula](https://www.nhs.uk/conditions/baby/breastfeeding-and-bottle-feeding/bottle-feeding/types-of-formula/)",
    "section": "Formula milk",
    "source_url": "https://www.nhs.uk/conditions/baby/weaning-and-feeding/drinks-and-cups-for-babies-and-young-children/",
    "title": "Drinks And Cups For Babies And Young Children",
    "chunk_id": "drinks_and_cups_for_babies_and_young_children_formula_milk_0",
    "scraped_at": "2025-04-04T05:17:59.022092",
    "tokens": 162
  },
  {
    "chunk": "the types of infant formula](https://www.nhs.uk/conditions/baby/breastfeeding-and-bottle-feeding/bottle-feeding/types-of-formula/)",
    "section": "Formula milk",
    "source_url": "https://www.nhs.uk/conditions/baby/weaning-and-feeding/drinks-and-cups-for-babies-and-young-children/",
    "title": "Drinks And Cups For Babies And Young Children",
    "chunk_id": "drinks_and_cups_for_babies_and_young_children_formula_milk_1",
    "scraped_at": "2025-04-04T05:17:59.022092",
    "tokens": 6
  },
  {
    "chunk": "Goats' milk formula is available and produced to the same nutritional standards as cows' milk formula. Goats' milk formula is not suitable for babies with [cows' milk protein allergy](https://www.allergyuk.org/resources/does-my-child-have-a-cows-milk-allergy/). It's no less likely to cause allergies in babies than cows' milk formula as the proteins they contain are very similar. You should only give your baby soya formula if a health professional advises you to. 'Goodnight' milk \"Goodnight\" milk is not suitable for babies under 6 months old. This type of formula is not needed, and there's no evidence that babies settle better or sleep longer after having it.",
    "section": "Non-cows' milk formula",
    "source_url": "https://www.nhs.uk/conditions/baby/weaning-and-feeding/drinks-and-cups-for-babies-and-young-children/",
    "title": "Drinks And Cups For Babies And Young Children",
    "chunk_id": "drinks_and_cups_for_babies_and_young_children_non-cows'_milk_formula_0",
    "scraped_at": "2025-04-04T05:17:59.022092",
    "tokens": 128
  },
  {
    "chunk": "Once your baby has started to eat solid foods (from around 6 months) you can offer them sips of water from a cup or beaker with meals. Drinking water for babies over 6 months does not need to be boiled first. Fully breastfed babies do not need any water until they've started eating solid foods. During hot weather they may want to breastfeed more than usual. Formula fed babies under 6 months of age may need small sips of cooled boiled water during hot weather as well as their usual milk feeds. [Find out how to make up baby formula safely using water](https://www.nhs.uk/conditions/baby/breastfeeding-and-bottle-feeding/bottle-feeding/making-up-baby-formula/)",
    "section": "Water",
    "source_url": "https://www.nhs.uk/conditions/baby/weaning-and-feeding/drinks-and-cups-for-babies-and-young-children/",
    "title": "Drinks And Cups For Babies And Young Children",
    "chunk_id": "drinks_and_cups_for_babies_and_young_children_water_0",
    "scraped_at": "2025-04-04T05:17:59.022092",
    "tokens": 133
  },
  {
    "chunk": "Cows' milk can be used in cooking or mixed with food from around 6 months but should not be given as a main drink to babies until they're 12 months old. This is because cows' milk does not contain the right balance of nutrients to meet your baby's needs. Pasteurised whole milk and semi-skimmed milk can be introduced as a main drink once your child is 1 year old. Skimmed and 1% milk should not be given as a main drink to children under 5 years old because they do not contain enough calories. Lower-fat milks can be used in cooking from 1 year old.",
    "section": "Cows' milk",
    "source_url": "https://www.nhs.uk/conditions/baby/weaning-and-feeding/drinks-and-cups-for-babies-and-young-children/",
    "title": "Drinks And Cups For Babies And Young Children",
    "chunk_id": "drinks_and_cups_for_babies_and_young_children_cows'_milk_0",
    "scraped_at": "2025-04-04T05:17:59.022092",
    "tokens": 136
  },
  {
    "chunk": "Young children should not be given unpasteurised milk because of the higher risk of food poisoning.",
    "section": "Unpasteurised milk",
    "source_url": "https://www.nhs.uk/conditions/baby/weaning-and-feeding/drinks-and-cups-for-babies-and-young-children/",
    "title": "Drinks And Cups For Babies And Young Children",
    "chunk_id": "drinks_and_cups_for_babies_and_young_children_unpasteurised_milk_0",
    "scraped_at": "2025-04-04T05:17:59.022092",
    "tokens": 20
  },
  {
    "chunk": "Goats' and sheep's milk are not suitable as a main drink for babies under 1 year old as, like cows' milk, they do not contain enough iron and other nutrients babies this age need. As long as they're pasteurised, they can be given as a main drink once your baby is 1 year old.",
    "section": "Goats' and sheep's milk",
    "source_url": "https://www.nhs.uk/conditions/baby/weaning-and-feeding/drinks-and-cups-for-babies-and-young-children/",
    "title": "Drinks And Cups For Babies And Young Children",
    "chunk_id": "drinks_and_cups_for_babies_and_young_children_goats'_and_sheep's_milk_0",
    "scraped_at": "2025-04-04T05:17:59.022092",
    "tokens": 70
  },
  {
    "chunk": "You can give your child unsweetened calcium-fortified milk alternatives, such as soya, oat or almond drinks, from the age of 1 as part of a healthy balanced diet. Babies and young children under 5 years old should not be given rice drinks, because of the levels of arsenic in these products. If your child has an allergy or intolerance to milk, talk to your health visitor or GP. They can advise you about suitable milk alternatives.",
    "section": "Soya drinks and other milk alternatives",
    "source_url": "https://www.nhs.uk/conditions/baby/weaning-and-feeding/drinks-and-cups-for-babies-and-young-children/",
    "title": "Drinks And Cups For Babies And Young Children",
    "chunk_id": "drinks_and_cups_for_babies_and_young_children_soya_drinks_and_other_milk_alternatives_0",
    "scraped_at": "2025-04-04T05:17:59.022092",
    "tokens": 98
  },
  {
    "chunk": "Children under 5 years old should not have rice drinks as a substitute for breast milk, infant formula or cows' milk as they may contain too much arsenic. Arsenic is found naturally in the environment and can find its way into our food and water. Rice tends to take up more arsenic than other grains, but this does not mean that your baby cannot eat rice. In the UK, there are maximum levels of inorganic arsenic allowed in rice and rice products, and even stricter levels are set for foods intended for young children. Do not worry if your child has already had rice drinks. There's no immediate risk to them, but it's best to switch to a different kind of milk.",
    "section": "Rice drinks",
    "source_url": "https://www.nhs.uk/conditions/baby/weaning-and-feeding/drinks-and-cups-for-babies-and-young-children/",
    "title": "Drinks And Cups For Babies And Young Children",
    "chunk_id": "drinks_and_cups_for_babies_and_young_children_rice_drinks_0",
    "scraped_at": "2025-04-04T05:17:59.022092",
    "tokens": 158
  },
  {
    "chunk": "of milk.",
    "section": "Rice drinks",
    "source_url": "https://www.nhs.uk/conditions/baby/weaning-and-feeding/drinks-and-cups-for-babies-and-young-children/",
    "title": "Drinks And Cups For Babies And Young Children",
    "chunk_id": "drinks_and_cups_for_babies_and_young_children_rice_drinks_1",
    "scraped_at": "2025-04-04T05:17:59.022092",
    "tokens": 2
  },
  {
    "chunk": "Fruit juices, such as orange juice, are a good source of vitamin C. However, they also contain natural sugars and acids, which can cause tooth decay. Babies under 12 months do not need fruit juice or smoothies. If you choose to give these to your baby, dilute the juices and smoothies (one part juice to 10 parts water) and limit them to mealtimes. Giving fruit juice and smoothies at mealtimes (rather than between meals) helps reduce the risk of tooth decay. From 5 years old, you can give your child undiluted fruit juice or smoothies. Stick to no more than 1 glass (about 150 ml) a day, served with meals. Squashes, flavoured milk, 'fruit' or 'juice' drinks and fizzy drinks Squashes, flavoured milk, \"fruit\" or \"juice\" drinks and fizzy drinks are not suitable for young babies. They contain sugar and can cause tooth decay, even when diluted. For older babies",
    "section": "Fruit juice and smoothies",
    "source_url": "https://www.nhs.uk/conditions/baby/weaning-and-feeding/drinks-and-cups-for-babies-and-young-children/",
    "title": "Drinks And Cups For Babies And Young Children",
    "chunk_id": "drinks_and_cups_for_babies_and_young_children_fruit_juice_and_smoothies_0",
    "scraped_at": "2025-04-04T05:17:59.022092",
    "tokens": 195
  },
  {
    "chunk": "Squashes, flavoured milk, \"fruit\" or \"juice\" drinks and fizzy drinks are not suitable for young babies. They contain sugar and can cause tooth decay, even when diluted. For older babies and young children, these drinks can fill your child up so they're not hungry for healthier food. Instead, offer sips of water from a cup with meals. Fizzy drinks are acidic and can damage tooth enamel so they should not be given to babies and young children. Diet or reduced-sugar drinks are not recommended for babies and young children. Even low-calorie drinks and no-added-sugar drinks can encourage children to develop a sweet tooth.",
    "section": "Fruit juice and smoothies",
    "source_url": "https://www.nhs.uk/conditions/baby/weaning-and-feeding/drinks-and-cups-for-babies-and-young-children/",
    "title": "Drinks And Cups For Babies And Young Children",
    "chunk_id": "drinks_and_cups_for_babies_and_young_children_fruit_juice_and_smoothies_1",
    "scraped_at": "2025-04-04T05:17:59.022092",
    "tokens": 133
  },
  {
    "chunk": "Children aged 4 years and under should not have slush ice drinks, sometimes known as slushies, as they may contain too much glycerol. Slush ice drinks can have high levels of glycerol in them, used instead of sugar, to create the slush effect. Young children who have too much glycerol may get a headache or feel sick. If they have a lot of glycerol, it can cause symptoms such as feeling dizzy, low blood sugar (glucose), confusion and they can even pass out. 'Baby' and herbal drinks \"Baby\" and herbal drinks usually contain sugars and are not recommended.",
    "section": "Slush ice drinks",
    "source_url": "https://www.nhs.uk/conditions/baby/weaning-and-feeding/drinks-and-cups-for-babies-and-young-children/",
    "title": "Drinks And Cups For Babies And Young Children",
    "chunk_id": "drinks_and_cups_for_babies_and_young_children_slush_ice_drinks_0",
    "scraped_at": "2025-04-04T05:17:59.022092",
    "tokens": 127
  },
  {
    "chunk": "Tea and coffee are not suitable for babies or young children. If sugar is added, this can lead to tooth decay.",
    "section": "Hot drinks",
    "source_url": "https://www.nhs.uk/conditions/baby/weaning-and-feeding/drinks-and-cups-for-babies-and-young-children/",
    "title": "Drinks And Cups For Babies And Young Children",
    "chunk_id": "drinks_and_cups_for_babies_and_young_children_hot_drinks_0",
    "scraped_at": "2025-04-04T05:17:59.022092",
    "tokens": 27
  },
  {
    "chunk": "For information and advice you can trust, sign up for weekly [Start for Life pregnancy and baby emails](https://www.nhs.uk/start-for-life/start-for-life-emails/). Video: Should my baby use a beaker or a cup? In this video, a health visitor talks about whether your baby should use a beaker or a cup. Media review due: 28 September 2026",
    "section": "Get Start for Life pregnancy and baby emails",
    "source_url": "https://www.nhs.uk/conditions/baby/weaning-and-feeding/drinks-and-cups-for-babies-and-young-children/",
    "title": "Drinks And Cups For Babies And Young Children",
    "chunk_id": "drinks_and_cups_for_babies_and_young_children_get_start_for_life_pregnancy_and_baby_emails_0",
    "scraped_at": "2025-04-04T05:17:59.022092",
    "tokens": 67
  }
]